[
    {
        "theory-category": "world_theories",
        "user": "WillDrens",
        "title": "Depressing Raftel Theory",
        "description": "A Depressing Theory about how I think the One Piece story will end",
        "content": "I'm going to come at this theory from the perspective of a writer, so take this as you will.I firmly believe Raftel will be destroyed by Pluton, either by the World Govt. or by Blackbeard. There are two main plot threads to One Piece at the moment: - Luffy becoming Pirate King by reaching Raftel - The problems with the government (most notably the world nobles/celestial dragons) who are currently in Mariejoa. Now, usually one of these is dropped at the end of Act II in stories, just to let you know the other means business. I'm hedging my bets that the former (Raftel) gets drop kicked by the latter (the World Govt.), thus starting Act III. Why do I think this? Well, I'll start with the less concrete answers, before moving into the more definitive: Consider the end of Act 1 of One Piece, also known as the end of the 'Super Rookies' saga, with the Battle At Marineford. That lasted the entirety of 'Paradise', or one half of the grand line. Now consider Act 2 to be of the same length (the entirety of the New World), and Act 3 would return to Paradise, ending at Mariejoa, which is at the end of Paradise. Though circumstantial, one could also consider the classic hero's journey, where Acts 1 and 3 take place within the world of the norm. (Not to say Act 3 would be as long as Act 2 currently is, it might be as long as a saga or two.) What would finding Raftel accomplish? Yes, Luffy would become the pirate king, but at least currently, One Piece is not just about Luffy becoming Pirate King, it's about him helping the people along the way. I point to the Alabasta Arc in particular, if the sole goal of Luffy's journey was to find One Piece, then why would he help the kingdom of Alabasta? In many ways, Raftel is a Macguffin, an arbitrary location to obtain the title of 'King of the Pirates'. It was foretold that Fishman Island would fall because of Luffy, and I don't think Oda means to kill them off screen. This means that the Straw Hats would return to Fishman Island, which means another trip through Paradise. If one is looking for a narrative, in-universe explanation for how the Marines reach Raftel, they have the power to sail across the calm belt. How they have not managed to reach Raftel (Go to the edge of the north sea, sail down) remains a mystery that I'm sure someone will point out the answer to in the comments below. Taking all that into account, Raftel being destroyed does not seem so far fetched. It actually seems like the raising of the stakes. But then again, I'm an idiot just trying to apply logic to a twenty-year old story which so far has done exceptionally well at long form story telling, and setup & payoff. EDIT: Looking over the comments, I've seen a couple of things. First off, I admit, the first major plot thread I mentioned (Luffy becoming Pirate King) is actually not a major plot thread, but instead, part of the larger thing of everyone following their dreams, hence the thematic approach of piracy = freedom, 'king of the pirates' is the one who is most free. Second off, Reason 4 is completely off the mark, I fully admit to that. Third, on reason 3, some people have commented that I've been off base, that it was only someone wearing a straw hat that would destroy Fishman Island, not specifically Luffy. I'll deal with this point in particular later, but I think I should explain my methodology first, and why I think Raftel is still going to be destroyed (either before the straw hats get there, or just after they arrive): Raftel is the symbol of the Great Pirate Era. Whoever finds it will become 'king of the pirates', and we see anyone confirming it (Roger or WB) causing a resurgence of piracy. This does not mean just circumnavigating the Grand Line, for, if that were the case, then Dorry, Broggy, and any other giant from Elbaf we see in 'Paradise' is technically 'king of the pirates', as Elbaf is in the New World, and I don't think the Germa are helping them. Luffy's goal of becoming 'king of the pirates' is intrinsically tied to him finding Raftel. However, as stated in the comments, Roger became 'king of the pirates' before finding Raftel, simply by other people declaring him King of the Pirates. If Raftel were to be destroyed, by say, Pluton, this would in effect be the WG's attempt to end the pirate era. This probably has some ties to Blackbeard, as if anyone were to have a way to decode Poneglyphs besides Nico Robin, it'd be him, and it's heavily implied in Alabasta that the Poneglyph found in that arc is to the location of Pluton. This would then throw Luffy's main motivation into confusion, which then leads to the reaffirmation of the destruction of the WG as the main plot thread. Yes, I'm expecting some revelations to come out of Raftel about the Void Century (maybe an explanation for why the Nefertari, who are one of the founders of the WG, have a Poneglyph that leads to Pluton). Yes, I know I'm an idiot who hasn't read the entirety of the story thus far, yet still is making theories like MatPat on a good day. But what I'm looking at is simple set-up and pay-off, which Oda does exceptionally well at. Which leads me to why I think there will be a return to 'Paradise' arc/saga (maybe about the length of 2 current sagas, maybe about a third the length of the new world), and why reason 3 still stands. There's a lot of set-up for Fishman Island being destroyed, it's a major point of conflict in that arc that someone in a straw hat will destroy the island. Some have commented that this is when Luffy destoys the Grand Line, however, I point again to the WG fishman racism setup as a reason for this not being the case. If Luffy does not destroy Mariejoa and the current state of the government directly when Fishman Island is destroyed, then the Fishmen are well and truly screwed. I'm also saying that some other guy in a straw hat, destroying Fishman Island, would be absolutely idiotic, as the Straw Hat is kind of Luffy's defining outfit piece, and no one else of import (as of the current time in the story, yes, I know, Shanks and Roger wore the hat too) wears a straw hat. It also would be really poor pay-off if someone else destroys Fishman Island, what, does Nami open the paper and see 'Fishman Island Destroyed'? Also, on the point of the crew's dreams, Mihawk and Laboon are in Paradise. TL;DR: Basically, the amount of set-up that went into certain points means that there's almost assuredly going to be a fight at Mariejoa, however, this being dissonant with Luffy finding Raftel and becoming King of the Pirates, Raftel has to be destroyed, thus causing a change in motivation for Luffy."
    }
]